#+BEGIN_EXPORT html
---
layout: page
title: Meta-Declarative Paradigm of Programming
tagline: " trust but verify"
permalink: /python/meta-declarative-programming.html
categories: [FastAPI, Python, Meta-Declarative Programming, OpenAI]
tags: [intro]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+PROPERTY: header-args+ :session declarative_programming
#+PROPERTY: vizier-thread-id thread_P1IWm6tT9kp7NsERBQyN0Mbt
#+PROPERTY: vizier-assistant-id asst_9U8N72u9uVQesQNNjgOLJOu8
#+TOC: headlines 3

** Question

I write Python code block where I put the app and the test suite
together in sake of clarity:

#+begin_src python
import unittest
from typing import Union
from fastapi import FastAPI
from fastapi.testclient import TestClient


app = FastAPI()
client = TestClient(app)

@app.get("/")
def read_root():
    return {"Method": "GET"}

class TestFastAPIGetMethod(unittest.TestCase):

    def test_read_root(self):
        response = client.get("/")
        self.assertEqual(response.status_code, 200)
        self.assertDictEqual(response.json(), {"Method": "GET"})

unittest.main(exit=False)
#+end_src

#+RESULTS:
: .
: ----------------------------------------------------------------------
: Ran 1 test in 0.006s
: 
: OK
Now I want to extend my app by adding new endpoints for POST, DELETE
and PUT methods.

*** Code
#+begin_src python
import unittest
from typing import Union, Dict
from fastapi import FastAPI, HTTPException
from fastapi.testclient import TestClient

app = FastAPI()
client = TestClient(app)

# In-memory storage for demonstration purposes
items = {}

@app.get("/")
def read_root():
    return {"Method": "GET"}

@app.post("/items/{item_id}")
def create_item(item_id: int, item: Dict):
    if item_id in items:
        raise HTTPException(status_code=400, detail="Item already exists")
    items[item_id] = item
    return {"Method": "POST", "item_id": item_id, "item": item}

@app.put("/items/{item_id}")
def update_item(item_id: int, item: Dict):
    if item_id not in items:
        raise HTTPException(status_code=404, detail="Item not found")
    items[item_id] = item
    return {"Method": "PUT", "item_id": item_id, "item": item}

@app.delete("/items/{item_id}")
def delete_item(item_id: int):
    if item_id not in items:
        raise HTTPException(status_code=404, detail="Item not found")
    del items[item_id]
    return {"Method": "DELETE", "item_id": item_id}

class TestFastAPI(unittest.TestCase):

    def test_read_root(self):
        response = client.get("/")
        self.assertEqual(response.status_code, 200)
        self.assertDictEqual(response.json(), {"Method": "GET"})

    def test_create_item(self):
        response = client.post("/items/1", json={"name": "Item1"})
        self.assertEqual(response.status_code, 200)
        self.assertDictEqual(response.json(), {"Method": "POST", "item_id": 1, "item": {"name": "Item1"}})

    def test_create_item_already_exists(self):
        client.post("/items/1", json={"name": "Item1"})
        response = client.post("/items/1", json={"name": "Item1 Duplicate"})
        self.assertEqual(response.status_code, 400)
        self.assertDictEqual(response.json(), {"detail": "Item already exists"})

    def test_update_item(self):
        client.post("/items/1", json={"name": "Item1"})
        response = client.put("/items/1", json={"name": "Updated Item1"})
        self.assertEqual(response.status_code, 200)
        self.assertDictEqual(response.json(), {"Method": "PUT", "item_id": 1, "item": {"name": "Updated Item1"}})
    
    def test_update_item_not_found(self):
        response = client.put("/items/999", json={"name": "Non-existent Item"})
        self.assertEqual(response.status_code, 404)
        self.assertDictEqual(response.json(), {"detail": "Item not found"})
    
    def test_delete_item(self):
        client.post("/items/1", json={"name": "Item1"})
        response = client.delete("/items/1")
        self.assertEqual(response.status_code, 200)
        self.assertDictEqual(response.json(), {"Method": "DELETE", "item_id": 1})
    
    def test_delete_item_not_found(self):
        response = client.delete("/items/999")
        self.assertEqual(response.status_code, 404)
        self.assertDictEqual(response.json(), {"detail": "Item not found"})

unittest.main(exit=False)
#+end_src

#+RESULTS:
: ........
: ----------------------------------------------------------------------
: Ran 8 tests in 0.031s
: 
: OK

